import 'package:gozal_ismlar/data/models/name_model.dart';

class DummyData {
  List<NameModel> names = [];
  List<String> namesInKirill = [
    'Абдулазиз',
    'Бекзод',
    'Абдузоҳир',
    'Абдулахад',
    'Абдулборий',
    'Абдулвали',
    'Ансор',
    'Бахриддин',
    'Бекзод',
  ];
  List<String> namesInLatin = [
    'Abdulaziz',
    'Bekzod',
    'Abduzohir',
    'Abdulahad',
    'Abdulboriy',
    'Abdulvali',
    'Ansor',
    'Bahriddin',
    'Bekzod',
  ];
  List<String> meanings = [
    'буюк ва қудратли Аллоҳнинг бандаси. Арабча',
    'бек фарзанди, беклар авлодига, зотига мансуб бола. Виқорли, кучли, мард бўлсин. Ўзбекча, форс-тожикча.',
    '(ар.) – барча нарсадан устун, олий, атрофдаги нарса ва ҳолатлар Унинг зоҳирлигига далолат қилувчи Аллоҳнинг бандаси *',
    'яккаю-ягона бўлган Аллоҳнинг бандаси. Арабча',
    'йўқдан бор қилувчи, яратувчи Аллоҳнинг бандаси. Арабча',
    'дўст, мададкор Аллоҳнинг бандаси. Арабча',
    'ёрдамчи, маслакдош. Бу ерда пайғамбарга кўмакдош бўлганлар кўзда тутилади. Арабча.',
    'диннинг нури, ёғдуси, шуъласи, диннинг виқори, шукуҳи ёки диннинг нурли, эътиқодли, иймонли, саодатманд кишиси. Арабча.',
    'бек фарзанди, беклар авлодига, зотига мансуб бола. Виқорли, кучли, мард бўлсин. Ўзбекча, форс-тожикча.',
  ];
  List<String> peopleWithThisName = [
    '123',
    '222324',
    '   1. Абдузоҳир ибн Фазл (Мисрдаги Фотимийлар давлати вазирларидан).\n\n   2. Абдузоҳир ибн Муҳаммад Нуриддин Абу Самҳ Талиний (Маккаи мукаррама хатиби ва имоми, Мисрнинг “Ал-Азҳар” билим юртида ўқиб, фақиҳ бўлган. У аввал Искандариядаги “Абу Ҳошим” масжиди имоми бўлган. Малик Абдулъазиз ибн Сауд уни Маккага таклиф қилиб, Макка имоми ва Дорул ҳадис раиси вазифасига тайинлаган).',
    '789',
    '101112',
    '131415',
    '161718',
    '192021',
    '222324',
  ];
  DummyData() {
    for (int i = 0; i < namesInLatin.length; i++) {
      names.add(
        NameModel(
          id: i,
          name: namesInKirill[i],
          nameInLatin: namesInLatin[i],
          meaning: meanings[i],
          peopleWithThisName: peopleWithThisName[i],
          isMaleName: true,
        ),
      );
    }
  }
}
